PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
/*!
    \file    gd32f3x0_hal_i2c.c
    \brief   I2C driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

#define SLAVE10_FIRST_BYTE(address)         ((0xF0) | (uint8_t)((address & 0x0300U)>>7U))
#define SLAVE10_SECOND_BYTE(address)        ((uint8_t)(address & 0x00FFU))
#define I2C_MEMORY_ADDRESS_MSB(address)     ((uint8_t)((address & 0xFF00U) >> 8U))
#define I2C_MEMORY_ADDRESS_LSB(address)     ((uint8_t)(address & 0x00FFU))

/* wait the flag status until timeout */
static int32_t _i2c_wait_flag_timeout(uint32_t i2c_periph, i2c_flag_enum flag, \
                                      FlagStatus status, uint32_t timeout_ms);

/* master sends device address for write request */
static int32_t _i2c_master_write(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms);
/* event handler in I2C master transmit mode */
static void _i2c_master_transmit_interrupt(void *i2c);
/* DMA full finish handler in I2C master transmit mode */
static void _i2c_transmit_dma(void *dma);
/* handle the I2C DMA error process */
static void _i2c_dma_error(void *dma);

/* master sends device address for read request */
static int32_t _i2c_master_read(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms);
/* event handler in I2C master receive mode */
static void _i2c_master_receive_interrupt(void *i2c);
/* DMA full finish handler in I2C master receive mode */
static void _i2c_receive_dma(void *dma);

/* event handler in I2C slave transmit mode */
static void _i2c_slave_transmit_interrupt(void *i2c);
/* event handler in I2C slave receive mode */
static void _i2c_slave_receive_interrupt(void *i2c);
/* event handler in I2C slave serial receive mode */
static void _i2c_slave_serial_receive_interrupt(void *i2c);

/* master sends device address for memory write request */
static int32_t _i2c_memory_write(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms);
/* master sends device address for memory read request */
static int32_t _i2c_memory_read(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms);
/* event handler of memory write in I2C master mode */
static void _i2c_memmory_write_interrupt(void *i2c);
/* event handler of memory read in I2C master mode */
static void _i2c_memory_read_interrupt(void *i2c);

/* event handler for address listen in slave mode */
static void _i2c_address_listen_interrupt(void *i2c);

/*!
    \brief      initialize the I2C structure with the default values
    \param[in]  struct_type: refer to hal_i2c_struct_type_enum
    \param[in]  p_struct: pointer to I2C structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_i2c_struct_init(hal_i2c_struct_type_enum struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct) {
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(struct_type) {
    case HAL_I2C_INIT_STRUCT:
        /* initialize I2C initialization structure with the default values */
        ((hal_i2c_init_struct *)p_struct)->duty_cycle = I2C_DTCY_2;
        ((hal_i2c_init_struct *)p_struct)->clock_speed = 100000U;
        ((hal_i2c_init_struct *)p_struct)->address_format = I2C_ADDFORMAT_7BITS;
        ((hal_i2c_init_struct *)p_struct)->own_address1 = 0U;
        ((hal_i2c_init_struct *)p_struct)->dual_address = I2C_DUADEN_DISABLE;
        ((hal_i2c_init_struct *)p_struct)->own_address2 = 0U;
        ((hal_i2c_init_struct *)p_struct)->general_call = I2C_GCEN_DISABLE;
        ((hal_i2c_init_struct *)p_struct)->no_stretch = I2C_SCLSTRETCH_DISABLE;
        break;
    case HAL_I2C_DEV_STRUCT:
        /* initialize I2C device information structure with the default values */
        ((hal_i2c_dev_struct *)p_struct)->periph = 0;
        ((hal_i2c_dev_struct *)p_struct)->i2c_irq.error_handle = NULL;
        ((hal_i2c_dev_struct *)p_struct)->i2c_irq.event_handle = NULL;
        ((hal_i2c_dev_struct *)p_struct)->p_dma_rx = NULL;
        ((hal_i2c_dev_struct *)p_struct)->p_dma_tx = NULL;
        ((hal_i2c_dev_struct *)p_struct)->txbuffer.buffer = NULL;
        ((hal_i2c_dev_struct *)p_struct)->txbuffer.length = 0U;
        ((hal_i2c_dev_struct *)p_struct)->txbuffer.pos = 0U;
        ((hal_i2c_dev_struct *)p_struct)->rxbuffer.buffer = NULL;
        ((hal_i2c_dev_struct *)p_struct)->rxbuffer.length = 0U;
        ((hal_i2c_dev_struct *)p_struct)->rxbuffer.pos = 0U;
        ((hal_i2c_dev_struct *)p_struct)->rxbuffer.pos = 0U;
        ((hal_i2c_dev_struct *)p_struct)->error_state = HAL_I2C_ERROR_NONE;
        ((hal_i2c_dev_struct *)p_struct)->tx_state = HAL_I2C_STATE_READY;
        ((hal_i2c_dev_struct *)p_struct)->rx_state = HAL_I2C_STATE_READY;
        ((hal_i2c_dev_struct *)p_struct)->previous_state = HAL_I2C_PREVIOUS_STATE_NONE;
        ((hal_i2c_dev_struct *)p_struct)->last_error = HAL_I2C_ERROR_NONE;
        ((hal_i2c_dev_struct *)p_struct)->slave_address.device_address = 0U;
        ((hal_i2c_dev_struct *)p_struct)->slave_address.memory_address = 0U;
        ((hal_i2c_dev_struct *)p_struct)->slave_address.address_size = I2C_MEMORY_ADDRESS_8BIT;
        ((hal_i2c_dev_struct *)p_struct)->slave_address.address_complete = RESET;
        ((hal_i2c_dev_struct *)p_struct)->slave_address.address_count = 0U;
        ((hal_i2c_dev_struct *)p_struct)->slave_address.second_addressing = RESET;
        ((hal_i2c_dev_struct *)p_struct)->transfer_option = I2C_NO_OPTION_TRANSFER;
        ((hal_i2c_dev_struct *)p_struct)->mutex = HAL_MUTEX_UNLOCKED;
        break;
    case HAL_I2C_IRQ_STRUCT:
        /* initialize I2C irq structure with the default values */
        ((hal_i2c_irq_struct *)p_struct)->error_handle = NULL;
        ((hal_i2c_irq_struct *)p_struct)->event_handle = NULL;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize I2C
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2c_deinit(hal_i2c_dev_struct *i2c_dev)
{
    uint32_t periph;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == i2c_dev) {
        HAL_DEBUGE("pointer [i2c_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

