PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    periph = i2c_dev->periph;
    if(I2C0 == periph) {
        hal_rcu_periph_reset_enable(RCU_I2C0RST);
        hal_rcu_periph_reset_disable(RCU_I2C0RST);

        hal_i2c_struct_init(HAL_I2C_DEV_STRUCT, i2c_dev);
        i2c_dev->periph = periph;
    } else if(I2C1 == periph) {
        hal_rcu_periph_reset_enable(RCU_I2C1RST);
        hal_rcu_periph_reset_disable(RCU_I2C1RST);
        hal_i2c_struct_init(HAL_I2C_DEV_STRUCT, i2c_dev);
        i2c_dev->periph = periph;
    } else {
        HAL_DEBUGE("parameter [i2c_dev->periph] value is invalid");
    }
}

/*!
    \brief      initialize I2C
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which I2C is initialized
    \param[in]  i2c_init: the initialization data needed to initialize I2C
                  duty_cycle: I2C_DTCY_2, I2C_DTCY_16_9
                  clock_speed: I2C clock speed, supports standard mode (up to 100 kHz), fast mode
                               (up to 400 kHz) and fast mode plus (up to 1MHz)
                  address_format: I2C_ADDFORMAT_7BITS, I2C_ADDFORMAT_10BITS
                  own_address1: I2C address
                  dual_address: I2C_DUADEN_ENABLE, I2C_DUADEN_DISABLE
                  own_address2: the second address in dual-address mode
                  general_call: I2C_GCEN_ENABLE, I2C_GCEN_DISABLE
                  no_stretch: I2C_SCLSTRETCH_ENABLE, I2C_SCLSTRETCH_DISABLE
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_init(hal_i2c_dev_struct *i2c_dev, uint32_t periph, \
                     hal_i2c_init_struct *i2c_init)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check I2C pointer and i2c_init address */
    if((NULL == i2c_dev) && (NULL == i2c_init)) {
        HAL_DEBUGE("pointer [i2c_dev] or [i2c_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check periph parameter */
    if((I2C0 != periph) && (I2C1 != periph)) {
        HAL_DEBUGE("parameter [periph] value is invalid");
        return HAL_ERR_VAL;
    }
    /* check periph value from I2C device struct */
    if(0 != i2c_dev->periph) {
        HAL_DEBUGI("periph value from i2c device struct has been rewrite");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    i2c_dev->periph = periph;
    /* configure I2C clock */
    hals_i2c_clock_config(periph, i2c_init->clock_speed, i2c_init->duty_cycle);
    /* configure I2C address */
    i2c_init->own_address1 = i2c_init->own_address1 << 1;
    hals_i2c_mode_addr_config(periph, I2C_I2CMODE_ENABLE, i2c_init->address_format, \
                              i2c_init->own_address1);
    /* configure dual-address mode */
    if(I2C_DUADEN_ENABLE == i2c_init->dual_address) {
        i2c_init->own_address2 = i2c_init->own_address2 << 1;
        hals_i2c_dualaddr_enable(periph, i2c_init->own_address2);
    } else {
        hals_i2c_dualaddr_disable(periph);
    }
    /* configure whether to stretch SCL low when data is not ready in slave mode */
    hals_i2c_stretch_scl_low_config(periph, i2c_init->no_stretch);
    /* whether or not to response to a general call */
    hals_i2c_slave_response_to_gcall_config(periph, i2c_init->general_call);
    /* enable I2C */
    HAL_I2C_ENABLE(periph);
    /* enable acknowledge */
    hals_i2c_ack_config(periph, I2C_ACK_ENABLE);
    i2c_dev->tx_state = HAL_I2C_STATE_READY;
    i2c_dev->rx_state = HAL_I2C_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      I2C error interrupt handler
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2c_error_irq(hal_i2c_dev_struct *i2c_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == i2c_dev) {
        HAL_DEBUGE("pointer [i2c_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* no acknowledge received */
    if(hals_i2c_interrupt_flag_get(i2c_dev->periph, I2C_INT_FLAG_AERR)) {
        hals_i2c_interrupt_flag_clear(i2c_dev->periph, I2C_INT_FLAG_AERR);
        i2c_dev->error_state |= HAL_I2C_ERROR_AERR;
        i2c_dev->last_error = HAL_I2C_ERROR_AERR;
    }

    /* over-run or under-run when SCL stretch is disabled */
    if(hals_i2c_interrupt_flag_get(i2c_dev->periph, I2C_INT_FLAG_OUERR)) {
        hals_i2c_interrupt_flag_clear(i2c_dev->periph, I2C_INT_FLAG_OUERR);
        i2c_dev->error_state |= HAL_I2C_ERROR_OUERR;
        i2c_dev->last_error = HAL_I2C_ERROR_OUERR;
    }

    /* arbitration lost */
    if(hals_i2c_interrupt_flag_get(i2c_dev->periph, I2C_INT_FLAG_LOSTARB)) {
        hals_i2c_interrupt_flag_clear(i2c_dev->periph, I2C_INT_FLAG_LOSTARB);
        i2c_dev->error_state |= HAL_I2C_ERROR_LOSTARB;
        i2c_dev->last_error = HAL_I2C_ERROR_LOSTARB;
    }

    /* bus error */
    if(hals_i2c_interrupt_flag_get(i2c_dev->periph, I2C_INT_FLAG_BERR)) {
        hals_i2c_interrupt_flag_clear(i2c_dev->periph, I2C_INT_FLAG_BERR);
        i2c_dev->error_state |= HAL_I2C_ERROR_BERR;
        i2c_dev->last_error = HAL_I2C_ERROR_BERR;
    }

    /* CRC value doesn't match */
    if(hals_i2c_interrupt_flag_get(i2c_dev->periph, I2C_INT_FLAG_PECERR)) {
        hals_i2c_interrupt_flag_clear(i2c_dev->periph, I2C_INT_FLAG_PECERR);
        i2c_dev->error_state |= HAL_I2C_ERROR_PECERR;
        i2c_dev->last_error = HAL_I2C_ERROR_PECERR;
    }

    if(HAL_I2C_ERROR_NONE != i2c_dev->error_state) {
        if(i2c_dev->i2c_irq.error_handle != NULL) {
            i2c_dev->i2c_irq.error_handle(i2c_dev);
            i2c_dev->error_state = HAL_I2C_ERROR_NONE;
        }
    }
}

/*!
    \brief      I2C event interrupt handler
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2c_event_irq(hal_i2c_dev_struct *i2c_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == i2c_dev) {
        HAL_DEBUGE("pointer [i2c_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(i2c_dev->i2c_irq.event_handle != NULL) {
        i2c_dev->i2c_irq.event_handle(i2c_dev);
        return;
    }

