PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
}

/*!
    \brief      start I2C module function
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval
*/
void hal_i2c_start(hal_i2c_dev_struct *i2c_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == i2c_dev) {
        HAL_DEBUGE("pointer [i2c_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    I2C_CTL0(i2c_dev->periph) |= I2C_CTL0_I2CEN;
}

/*!
    \brief      stop I2C module function
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval
*/
void hal_i2c_stop(hal_i2c_dev_struct *i2c_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == i2c_dev) {
        HAL_DEBUGE("pointer [i2c_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    I2C_CTL0(i2c_dev->periph) &= ~(I2C_CTL0_I2CEN);
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: the structure that contains callback handlers of I2C interrupt
                The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_i2c_irq_handle_set(hal_i2c_dev_struct *i2c_dev, hal_i2c_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [i2c_dev] or [p_irq] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* event interrupt handler set */
    if(NULL != p_irq->event_handle) {
        i2c_dev->i2c_irq.event_handle = p_irq->event_handle;
        hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_BUF);
        hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_EV);
    } else {
        i2c_dev->i2c_irq.event_handle = NULL;
        hals_i2c_interrupt_disable(i2c_dev->periph, I2C_INT_BUF);
        hals_i2c_interrupt_disable(i2c_dev->periph, I2C_INT_EV);
    }
    /* error interrupt handler set */
    if(NULL != p_irq->error_handle) {
        i2c_dev->i2c_irq.error_handle = p_irq->error_handle;
        hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_ERR);
    } else {
        i2c_dev->i2c_irq.error_handle = NULL;
        hals_i2c_interrupt_disable(i2c_dev->periph, I2C_INT_ERR);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2c_irq_handle_all_reset(hal_i2c_dev_struct *i2c_dev)
{
    /* configure interrupt callback function to NULL */
    i2c_dev->i2c_irq.event_handle = NULL;
    i2c_dev->i2c_irq.error_handle = NULL;
}

/*!
    \brief      transmit amounts of data in master mode, poll transmit process and completed status,
                the function is blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_master_transmit_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                     uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the tx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->tx_state) {
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* initialize transmit parameters */
    i2c_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->txbuffer.length = length;
    i2c_dev->txbuffer.pos = 0;
    data_length = i2c_dev->txbuffer.length;

    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }

    i2c_dev->tx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->error_state = HAL_I2C_ERROR_NONE;
    /* master sends device address for write request */
    if(HAL_ERR_NONE != _i2c_master_write(i2c_dev, timeout_ms)) {
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    while(i2c_dev->txbuffer.pos < data_length) {
        /* wait until the transmission data register is empty */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_TBE, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get TBE timeout");
            return HAL_ERR_TIMEOUT;
        }
        hals_i2c_data_transmit(i2c_dev->periph, *i2c_dev->txbuffer.buffer);
        i2c_dev->txbuffer.buffer++;
        i2c_dev->txbuffer.pos++;
    }
    /* send a stop condition to I2C bus */
    HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
    while(I2C_CTL0(i2c_dev->periph) & 0x0200);
    i2c_dev->tx_state = HAL_I2C_STATE_READY;

