PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data in master mode, poll receive process and completed
                status, the function is blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be read
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_master_receive_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                    uint32_t length, uint32_t timeout_ms)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the rx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->rx_state) {
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* initialize receive parameters */
    i2c_dev->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->rxbuffer.length = length;
    i2c_dev->rxbuffer.pos = 0;

    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }

    i2c_dev->rx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    /* master sends device address for read request */
    if(HAL_ERR_NONE != _i2c_master_read(i2c_dev, timeout_ms)) {
        return HAL_ERR_TIMEOUT;
    }
    if(1 == i2c_dev->rxbuffer.length) {
        /* disable acknowledge */
        hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
        /* clear ADDSEND bit */
        hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
        /* send a stop condition to I2C bus*/
        HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
    } else if(2 == i2c_dev->rxbuffer.length) {
        /* send a NACK for the next data byte which will be received into the shift register */
        hals_i2c_ackpos_config(i2c_dev->periph, I2C_ACKPOS_NEXT);
        /* disable acknowledge */
        hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
        /* clear ADDSEND bit */
        hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    } else {
        /* enable acknowledge */
        hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_ENABLE);
        /* clear ADDSEND bit */
        hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    }
    while(i2c_dev->rxbuffer.length > 0) {
        if(i2c_dev->rxbuffer.length <= 3) {
            if(1 == i2c_dev->rxbuffer.length) {
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                *i2c_dev->rxbuffer.buffer = hals_i2c_data_receive(i2c_dev->periph);
                i2c_dev->rxbuffer.buffer++;
                i2c_dev->rxbuffer.length--;
            } else if(2 == i2c_dev->rxbuffer.length) {
                hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
                /* wait until the BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_BTC, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                *i2c_dev->rxbuffer.buffer = hals_i2c_data_receive(i2c_dev->periph);
                i2c_dev->rxbuffer.buffer++;
                i2c_dev->rxbuffer.length--;
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                *i2c_dev->rxbuffer.buffer = hals_i2c_data_receive(i2c_dev->periph);
                i2c_dev->rxbuffer.buffer++;
                i2c_dev->rxbuffer.length--;
                HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
            } else {
                /* wait until the BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_BTC, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }

                hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
                *i2c_dev->rxbuffer.buffer = hals_i2c_data_receive(i2c_dev->periph);
                i2c_dev->rxbuffer.buffer++;
                i2c_dev->rxbuffer.length--;
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                *i2c_dev->rxbuffer.buffer = hals_i2c_data_receive(i2c_dev->periph);
                i2c_dev->rxbuffer.buffer++;
                i2c_dev->rxbuffer.length--;
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                *i2c_dev->rxbuffer.buffer = hals_i2c_data_receive(i2c_dev->periph);
                i2c_dev->rxbuffer.buffer++;
                i2c_dev->rxbuffer.length--;
                /* send a stop condition to I2C bus */
                HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
            }
        } else {
            /* wait until the RBNE bit is set */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
                HAL_DEBUGW("i2c get RBNE timeout");
                return HAL_ERR_TIMEOUT;
            }
            *i2c_dev->rxbuffer.buffer = hals_i2c_data_receive(i2c_dev->periph);
            i2c_dev->rxbuffer.buffer++;
            i2c_dev->rxbuffer.length--;
        }
    }
    i2c_dev->rx_state = HAL_I2C_STATE_READY;
    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data in slave mode, poll transmit process and completed status,
                the function is blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_slave_transmit_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                    uint32_t length, uint32_t timeout_ms)
{
    uint32_t address_format;
    uint32_t data_length;

