PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the tx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->tx_state) {
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* check the address format */
    if(I2C_SADDR0(i2c_dev->periph)&I2C_SADDR0_ADDFORMAT) {
        address_format = I2C_ADDFORMAT_10BITS;
    } else {
        address_format = I2C_ADDFORMAT_7BITS;
    }
    /* initialize transmit parameters */
    i2c_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->txbuffer.length = length;
    i2c_dev->txbuffer.pos = 0;
    data_length = i2c_dev->txbuffer.length;

    i2c_dev->tx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_ENABLE);
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    if(I2C_ADDFORMAT_10BITS == address_format) {
        /* wait until ADDSEND bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get ADDSEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* clear ADDSEND bit */
        hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    }
    while(data_length > i2c_dev->txbuffer.pos) {
        /* wait until the TBE bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_TBE, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get TBE timeout");
            return HAL_ERR_TIMEOUT;
        }
        hals_i2c_data_transmit(i2c_dev->periph, *i2c_dev->txbuffer.buffer);
        i2c_dev->txbuffer.buffer++;
        i2c_dev->txbuffer.pos++;
    }
    /* the master doesn't acknowledge for the last byte */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_AERR, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get AERR timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear the bit of AERR */
    hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_AERR);
    /* disable acknowledge */
    hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
    i2c_dev->tx_state = HAL_I2C_STATE_READY;

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data in slave mode, poll receive process and completed
                status, the function is blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be read
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_slave_receive_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                   uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the rx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->rx_state) {
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* initialize receive parameters */
    i2c_dev->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->rxbuffer.length = length;
    i2c_dev->rxbuffer.pos = 0;
    data_length = i2c_dev->rxbuffer.length;

    i2c_dev->rx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_ENABLE);
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);

    while(i2c_dev->rxbuffer.pos < data_length) {
        /* wait until the RBNE bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get RBNE timeout");
            return HAL_ERR_TIMEOUT;
        }
        *i2c_dev->rxbuffer.buffer = hals_i2c_data_receive(i2c_dev->periph);
        i2c_dev->rxbuffer.buffer++;
        i2c_dev->rxbuffer.pos++;
    }
    /* wait until the STPDET bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_STPDET, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get stop timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear the STPDET bit */
    HAL_I2C_ENABLE(i2c_dev->periph);

    hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
    i2c_dev->rx_state = HAL_I2C_STATE_READY;

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      write amounts of data to memory, poll transmit process and completed status,
                the function is blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_VAL,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_memory_write_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                  uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;

