PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    HAL_LOCK(i2c_dev);
    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c_dev->slave_address.address_size) && \
            (I2C_MEMORY_ADDRESS_16BIT != i2c_dev->slave_address.address_size)) {
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state whether it is busy or not */
    if(HAL_I2C_STATE_MEMORY_BUSY_TX == i2c_dev->tx_state) {
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize transmit parameters */
    i2c_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->txbuffer.length = length;
    i2c_dev->txbuffer.pos = 0;
    data_length = i2c_dev->txbuffer.length;

    i2c_dev->tx_state = HAL_I2C_STATE_MEMORY_BUSY_TX;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    /* master sends device address for memory write request */
    if(HAL_ERR_NONE != _i2c_memory_write(i2c_dev, timeout_ms)) {
        return HAL_ERR_TIMEOUT;
    }

    while(i2c_dev->txbuffer.pos < data_length) {
        /* wait until the transmission data register is empty */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_TBE, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get TBE timeout");
            return HAL_ERR_TIMEOUT;
        }
        hals_i2c_data_transmit(i2c_dev->periph, *i2c_dev->txbuffer.buffer);
        i2c_dev->txbuffer.buffer++;
        i2c_dev->txbuffer.pos++;
        /* wait until BTC bit is set */
        if((SET == hals_i2c_flag_get(i2c_dev->periph, I2C_FLAG_BTC)) && (i2c_dev->txbuffer.pos != data_length)) {
            HAL_DEBUGW("i2c get BTC timeout");
            return HAL_ERR_TIMEOUT;
        }
    }
    /* send a stop condition to I2C bus */
    HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
    while(I2C_CTL0(i2c_dev->periph) & 0x0200);
    i2c_dev->tx_state = HAL_I2C_STATE_READY;

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      read amounts of data from memory, poll receive process and completed status,
                the function is blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be read
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_VAL,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_memory_read_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                 uint32_t length, uint32_t timeout_ms)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c_dev->slave_address.address_size) && \
            (I2C_MEMORY_ADDRESS_16BIT != i2c_dev->slave_address.address_size)) {
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the rx_state whether it is busy or not */
    if(HAL_I2C_STATE_MEMORY_BUSY_RX == i2c_dev->rx_state) {
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }

    i2c_dev->rx_state = HAL_I2C_STATE_MEMORY_BUSY_RX;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    if(2 == length) {
        /* send a NACK for the next data byte which will be received into the shift register */
        hals_i2c_ackpos_config(i2c_dev->periph, I2C_ACKPOS_NEXT);
    }
    /* master sends device address for memory read request */
    if(HAL_ERR_NONE != _i2c_memory_read(i2c_dev, timeout_ms)) {
        return HAL_ERR_TIMEOUT;
    }

    if(1 == length) {
        /* disable acknowledge */
        hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
        /* clear ADDSEND bit */
        hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
        /* send a stop condition to I2C bus */
        HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
    } else if(2 == length) {
        /* disable acknowledge */
        hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
        /* clear ADDSEND bit */
        hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    } else {
        /* clear ADDSEND bit */
        hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    }
    while(length > 0) {
        if(length <= 3) {
            if(1 == length) {
                /* wait until RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                (*p_buffer++) = hals_i2c_data_receive(i2c_dev->periph);
                length--;
            } else if(2 == length) {
                hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
                /* wait until BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_BTC, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }
                /* send a stop condition to I2C bus */
                HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
                (*p_buffer++) = hals_i2c_data_receive(i2c_dev->periph);
                length--;
                (*p_buffer++) = hals_i2c_data_receive(i2c_dev->periph);
                length--;
            } else {
                /* wait until BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_BTC, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }
                /* disable acknowledge */
                hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
                (*p_buffer++) = hals_i2c_data_receive(i2c_dev->periph);
                length--;
                /* wait until BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_BTC, SET, timeout_ms)) {
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }
                /* send a stop condition to I2C bus */
                HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
                (*p_buffer++) = hals_i2c_data_receive(i2c_dev->periph);
                length--;
                (*p_buffer++) = hals_i2c_data_receive(i2c_dev->periph);
                length--;
            }
        } else {
            /* wait until RBNE bit is set */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_RBNE, SET, timeout_ms)) {
                HAL_DEBUGW("i2c get RBNE timeout");
                return HAL_ERR_TIMEOUT;
            }
            (*p_buffer++) = hals_i2c_data_receive(i2c_dev->periph);
            length--;
            /* wait until BTC bit is set */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_BTC, SET, timeout_ms)) {
                HAL_DEBUGW("i2c get BTC timeout");
                return HAL_ERR_TIMEOUT;
            }
            (*p_buffer++) = hals_i2c_data_receive(i2c_dev->periph);
            length--;
        }
    }
    i2c_dev->rx_state = HAL_I2C_STATE_READY;

