PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data in master mode by interrupt method, the function
                is non-blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_master_transmit_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
        uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the tx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->tx_state) {
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* the master waits until the I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize transmit parameters */
    i2c_dev->tx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->error_state = HAL_I2C_ERROR_NONE;
    i2c_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->txbuffer.length = length;
    i2c_dev->txbuffer.pos = 0;
    i2c_dev->tx_callback = (void *)p_user_func;
    i2c_dev->i2c_irq.event_handle = _i2c_master_transmit_interrupt;

    /* the master sends a start condition to I2C bus */
    HAL_I2C_START_ON_BUS(i2c_dev->periph);
    /* enable the I2C interrupt */
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_ERR);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_BUF);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_EV);

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data in master mode by interrupt method, the function
                is non-blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be read
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_master_receive_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
        uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the rx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->rx_state) {
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize receive parameters */
    i2c_dev->rx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    i2c_dev->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->rxbuffer.length = length;
    i2c_dev->rxbuffer.pos = 0;
    i2c_dev->rx_callback = (void *)p_user_func;
    i2c_dev->i2c_irq.event_handle = _i2c_master_receive_interrupt;
    if(2 == i2c_dev->rxbuffer.length) {
        /* send a NACK for the next data byte which will be received into the shift register */
        hals_i2c_ackpos_config(i2c_dev->periph, I2C_ACKPOS_NEXT);
    }

    /* enable the I2C interrupt */
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_ERR);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_BUF);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_EV);
    /* the master sends a start condition to I2C bus */
    HAL_I2C_START_ON_BUS(i2c_dev->periph);

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data in slave mode by interrupt method, the function is
                non-blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_slave_transmit_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
        uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the tx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->tx_state) {
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

