PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    /* initialize transmit parameters */
    i2c_dev->tx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->error_state = HAL_I2C_ERROR_NONE;
    i2c_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->txbuffer.length = length;
    i2c_dev->txbuffer.pos = 0;
    i2c_dev->tx_callback = (void *)p_user_func;
    i2c_dev->i2c_irq.event_handle = _i2c_slave_transmit_interrupt;

    /* enable I2C interrupt */
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_ERR);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_BUF);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_EV);

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data in slave mode by interrupt method, the function
                is non-blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be receive
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_slave_receive_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                        uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the rx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->rx_state) {
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* initialize transmit parameters */
    i2c_dev->rx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    i2c_dev->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->rxbuffer.length = length;
    i2c_dev->rxbuffer.pos = 0;
    i2c_dev->rx_callback = (void *)p_user_func;
    i2c_dev->i2c_irq.event_handle = _i2c_slave_receive_interrupt;
    /* enable I2C interrupt */
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_ERR);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_BUF);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_EV);

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      write amounts of data to memory by interrupt method, the function is non-blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be write
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_VAL,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_memory_write_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                       uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer, p_buffer address and length */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c_dev->slave_address.address_size) && \
            (I2C_MEMORY_ADDRESS_16BIT != i2c_dev->slave_address.address_size)) {
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the tx_state whether it is busy or not */
    if(HAL_I2C_STATE_MEMORY_BUSY_TX == i2c_dev->tx_state) {
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    /* initialize transmit parameters */
    i2c_dev->tx_state = HAL_I2C_STATE_MEMORY_BUSY_TX;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    i2c_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->txbuffer.length = length;
    i2c_dev->txbuffer.pos = 0;
    i2c_dev->tx_callback = (void *)p_user_func;
    i2c_dev->i2c_irq.event_handle = _i2c_memmory_write_interrupt;

    /* send a start condition to I2C bus */
    HAL_I2C_START_ON_BUS(i2c_dev->periph);
    /* enable I2C interrupt */
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_ERR);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_BUF);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_EV);
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      read amounts of data from memory by interrupt method, the function is non-blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be read
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_memory_read_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                      uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer, p_buffer address and length */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

