PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      write amounts of data to memory by dma method, the function is non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be write
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_memory_write_dma(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                 uint32_t length, hal_i2c_user_cb p_user_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer, p_buffer address and length */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c_dev->slave_address.address_size) && \
            (I2C_MEMORY_ADDRESS_16BIT != i2c_dev->slave_address.address_size)) {
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    /* initialize transmit parameters */
    i2c_dev->tx_state = HAL_I2C_STATE_MEMORY_BUSY_TX;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    i2c_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->txbuffer.length = length;
    i2c_dev->txbuffer.pos = 0;
    i2c_dev->tx_callback = (void *)p_user_func;
    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _i2c_transmit_dma;
    dma_irq.error_handle = _i2c_dma_error;
    if(NULL != i2c_dev->p_dma_tx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = i2c_dev->p_dma_tx->dma_irq.half_finish_handle;
    }
    /* master sends device address for memory write request */
    if(HAL_ERR_NONE != _i2c_memory_write(i2c_dev, I2C_TIMEOUT)) {
        return HAL_ERR_TIMEOUT;
    }

    /* enable I2C DMA */
    hals_i2c_dma_config(i2c_dev->periph, I2C_DMA_ON);
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(i2c_dev->p_dma_tx, (uint32_t)i2c_dev->txbuffer.buffer, \
                            (uint32_t)&I2C_DATA(i2c_dev->periph), length, &dma_irq);
    /* clear DMA global interrupt flag */
    hals_dma_flag_clear(i2c_dev->p_dma_tx->channel, DMA_INTF_GIF);

    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      read amounts of data from memory by dma method, the function is non-blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be read
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_memory_read_dma(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                uint32_t length, hal_i2c_user_cb p_user_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer, p_buffer address and length */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0 == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c_dev->slave_address.address_size) && \
            (I2C_MEMORY_ADDRESS_16BIT != i2c_dev->slave_address.address_size)) {
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)) {
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    /* initialize receive parameters */
    i2c_dev->rx_state = HAL_I2C_STATE_MEMORY_BUSY_RX;
    i2c_dev->last_error = HAL_I2C_ERROR_NONE;
    i2c_dev->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->rxbuffer.length = length;
    i2c_dev->rxbuffer.pos = 0;
    i2c_dev->rx_callback = (void *)p_user_func;
    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _i2c_transmit_dma;
    dma_irq.error_handle = _i2c_dma_error;
    if(NULL != i2c_dev->p_dma_rx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = i2c_dev->p_dma_rx->dma_irq.half_finish_handle;
    }

    /* master sends device address for memory read request */
    if(HAL_ERR_NONE != _i2c_memory_read(i2c_dev, I2C_TIMEOUT)) {
        return HAL_ERR_TIMEOUT;
    }
    if(2 == length) {
        /* send a NACK for the next data byte which will be received into the shift register */
        hals_i2c_ackpos_config(i2c_dev->periph, I2C_ACKPOS_NEXT);
    }
    if(1 == length) {
        /* disable acknowledge */
        hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_DISABLE);
    } else {
        /* configure the next DMA EOT as the DMA last transfer */
        hals_i2c_dma_last_transfer_config(i2c_dev->periph, I2C_DMALST_ON);
    }
    /* clear ADDSEND bit */
    hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    /* enable I2C DMA */
    hals_i2c_dma_config(i2c_dev->periph, I2C_DMA_ON);
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(i2c_dev->p_dma_rx, (uint32_t)&I2C_DATA(i2c_dev->periph), \
                            (uint32_t)i2c_dev->rxbuffer.buffer, length, &dma_irq);
    /* clear DMA global interrupt flag */
    hals_dma_flag_clear(i2c_dev->p_dma_rx->channel, DMA_INTF_GIF);

