PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    HAL_UNLOCK(i2c_dev);
    return HAL_ERR_NONE;
}

/*!
    \brief      check whether the device is ready for access
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_NONE,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_device_ready_check(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms)
{
    __IO uint32_t val = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer */
    if((NULL == i2c_dev)) {
        HAL_DEBUGE("parameter [i2c_dev] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    while(1) {
        while(hals_i2c_flag_get(i2c_dev->periph, I2C_FLAG_I2CBSY));
        /* wait until I2C bus is idle */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* check if I2C is already enabled */
        if(I2C_CTL0_I2CEN != (I2C_CTL0(i2c_dev->periph) & I2C_CTL0_I2CEN)) {
            HAL_I2C_ENABLE(i2c_dev->periph);
        }

        /* send a start condition to I2C bus */
        HAL_I2C_START_ON_BUS(i2c_dev->periph);
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_SBSEND, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get SBSEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* wait until SBSEND bit is set */
        while(!hals_i2c_flag_get(i2c_dev->periph, I2C_FLAG_SBSEND));
        /* send slave address to I2C bus */
        hals_i2c_master_addressing(i2c_dev->periph, i2c_dev->slave_address.device_address, I2C_TRANSMITTER);

        do {
            val = I2C_STAT0(i2c_dev->periph);
        } while(0 == (val & (I2C_STAT0_ADDSEND | I2C_STAT0_AERR)));

        if(val & I2C_STAT0_ADDSEND) {

            /* clear ADDSEND bit */
            hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
            /* send a stop condition to I2C bus */
            HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
            /* wait until I2C bus is idle */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
                HAL_DEBUGW("i2c busy timeout");
                return HAL_ERR_TIMEOUT;
            }
            return HAL_ERR_NONE;
        } else {
            /* clear AERR bit */
            hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_AERR);
            /* send a stop condition to I2C bus */
            HAL_I2C_STOP_ON_BUS(i2c_dev->periph);
            while(I2C_CTL0(i2c_dev->periph) & 0x0200);

            /* wait until I2C bus is idle */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)) {
                HAL_DEBUGW("i2c busy timeout");
                return HAL_ERR_TIMEOUT;
            }
        }
    }
}

/*!
    \brief      serial transmit amounts of data in master mode by interrupt method, the function
                is non-blocking
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_i2c_master_serial_transmit_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
        uint32_t length, hal_i2c_user_cb p_user_func)
{
    __IO uint32_t previous_state = 0x00U;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c_dev) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [i2c_dev] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    HAL_LOCK(i2c_dev);
    /* check the tx_state whether it is busy or not */
    if(HAL_I2C_STATE_BUSY == i2c_dev->tx_state) {
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    if((I2C_FIRST_TRANSFER == i2c_dev->transfer_option) || \
            (I2C_NO_OPTION_TRANSFER == i2c_dev->transfer_option)) {
        /* the master waits until the I2C bus is idle */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)) {
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
    }
    /* check if I2C is already enabled */
    if(I2C_CTL0_I2CEN != (I2C_CTL0(i2c_dev->periph) & I2C_CTL0_I2CEN)) {
        HAL_I2C_ENABLE(i2c_dev->periph);
    }
    i2c_dev->previous_state = HAL_I2C_PREVIOUS_STATE_NONE;

    /* initialize transmit parameters */
    i2c_dev->tx_state = HAL_I2C_STATE_BUSY;
    i2c_dev->error_state = HAL_I2C_ERROR_NONE;
    i2c_dev->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c_dev->txbuffer.length = length;
    i2c_dev->txbuffer.pos = 0;
    i2c_dev->tx_callback = (void *)p_user_func;
    i2c_dev->i2c_irq.event_handle = _i2c_master_transmit_interrupt;

    previous_state = i2c_dev->previous_state;

    if((previous_state ==HAL_I2C_PREVIOUS_STATE_NONE)||(previous_state == HAL_I2C_PREVIOUS_STATE_TX))
    {
        /* the master sends a start condition to I2C bus */
        HAL_I2C_START_ON_BUS(i2c_dev->periph);
    }
    /* enable the I2C interrupt */
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_ERR);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_BUF);
    hals_i2c_interrupt_enable(i2c_dev->periph, I2C_INT_EV);

