PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    /* get the interrupt enable bit status */
    intenable = (I2C_REG_VAL(i2c_periph, int_flag) & BIT(I2C_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (I2C_REG_VAL2(i2c_periph, int_flag) & BIT(I2C_BIT_POS2(int_flag)));

    if((I2C_INT_FLAG_RBNE == int_flag) || (I2C_INT_FLAG_TBE == int_flag)) {
        if(intenable && bufie) {
            intenable = 1U;
        } else {
            intenable = 0U;
        }
    }
    if((0U != flagstatus) && (0U != intenable)) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear I2C interrupt flag status
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  int_flag: I2C interrupt flags, refer to i2c_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        I2C_INT_FLAG_ADDSEND: address is sent in master mode or received and matches in slave mode interrupt flag
      \arg        I2C_INT_FLAG_BERR: a bus error occurs indication a unexpected start or stop condition on I2C bus interrupt flag
      \arg        I2C_INT_FLAG_LOSTARB: arbitration lost in master mode interrupt flag
      \arg        I2C_INT_FLAG_AERR: acknowledge error interrupt flag
      \arg        I2C_INT_FLAG_OUERR: over-run or under-run situation occurs in slave mode interrupt flag
      \arg        I2C_INT_FLAG_PECERR: PEC error when receiving data interrupt flag
      \arg        I2C_INT_FLAG_SMBTO: timeout signal in SMBus mode interrupt flag
      \arg        I2C_INT_FLAG_SMBALT: SMBus alert status interrupt flag
    \param[out] none
    \retval     none
*/
void hals_i2c_interrupt_flag_clear(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag)
{
    if(I2C_INT_FLAG_ADDSEND == int_flag) {
        /* read I2C_STAT0 and then read I2C_STAT1 to clear ADDSEND */
        I2C_STAT0(i2c_periph);
        I2C_STAT1(i2c_periph);
    } else {
        I2C_REG_VAL2(i2c_periph, int_flag) &= ~BIT(I2C_BIT_POS2(int_flag));
    }
}

/*!
    \brief      wait the flag status until timeout
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  flag: I2C flags, refer to i2c_flag_enum
    \param[in]  status: the status of I2C flag to wait
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
static int32_t _i2c_wait_flag_timeout(uint32_t i2c_periph, i2c_flag_enum flag, \
                                      FlagStatus status, uint32_t timeout_ms)
{
    uint32_t tick_start;
    /* set timeout */
    tick_start = hal_sys_basetick_count_get();
    /* wait flag status RESET */
    if(RESET == status) {
        while(SET == hals_i2c_flag_get(i2c_periph, flag)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("i2c get flag timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    } else {
        /* wait flag status SET */
        while(RESET == hals_i2c_flag_get(i2c_periph, flag)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("i2c get flag timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      master sends device address for write request
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
static int32_t _i2c_master_write(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms)
{
    uint16_t first_byte, second_byte;
    uint32_t address_format;
    /* check the address format */
    if(I2C_SADDR0(i2c_dev->periph)&I2C_SADDR0_ADDFORMAT) {
        address_format = I2C_ADDFORMAT_10BITS;
    } else {
        address_format = I2C_ADDFORMAT_7BITS;
    }
    /* send a start condition to I2C bus */
    HAL_I2C_START_ON_BUS(i2c_dev->periph);
    /* wait until SBSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_SBSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get SBSEND timeout");
        return HAL_ERR_TIMEOUT;
    }

    /* send slave address to I2C bus */
    if(I2C_ADDFORMAT_7BITS == address_format) {
        /* 7-bit addressing */
        hals_i2c_master_addressing(i2c_dev->periph, i2c_dev->slave_address.device_address, I2C_TRANSMITTER);
    } else {
        /* 10-bit addressing */
        first_byte = SLAVE10_FIRST_BYTE(i2c_dev->slave_address.device_address);
        second_byte = SLAVE10_SECOND_BYTE(i2c_dev->slave_address.device_address);

        hals_i2c_master_addressing(i2c_dev->periph, first_byte, I2C_TRANSMITTER);
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_ADD10SEND, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get ADD10SEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        hals_i2c_master_addressing(i2c_dev->periph, second_byte, I2C_TRANSMITTER);
    }
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      event handler in I2C master transmit mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_master_transmit_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    uint16_t first_byte, second_byte;
    uint32_t address_format;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->tx_callback;
    uint32_t data_length;

