PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    data_length = p_i2c->rxbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_SBSEND)) {
        if(!(I2C_SADDR0(p_i2c->periph)&I2C_SADDR0_ADDFORMAT)) {
            /* the master sends slave address */
            hals_i2c_master_addressing(p_i2c->periph, p_i2c->slave_address.device_address, I2C_RECEIVER);
        } else {
            first_byte = SLAVE10_FIRST_BYTE(p_i2c->slave_address.device_address);
            if(RESET == p_i2c->slave_address.second_addressing) {
                hals_i2c_master_addressing(p_i2c->periph, first_byte, I2C_TRANSMITTER);
                p_i2c->slave_address.second_addressing = SET;
            } else {
                hals_i2c_master_addressing(p_i2c->periph, first_byte, I2C_RECEIVER);
            }
        }
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADD10SEND)) {
        second_byte = SLAVE10_SECOND_BYTE(p_i2c->slave_address.device_address);
        hals_i2c_master_addressing(p_i2c->periph, second_byte, I2C_TRANSMITTER);
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)) {

        if((1 == p_i2c->rxbuffer.length) || (2 == p_i2c->rxbuffer.length)) {
            hals_i2c_ack_config(p_i2c->periph, I2C_ACK_DISABLE);
        }
        if(!(I2C_SADDR0(p_i2c->periph)&I2C_SADDR0_ADDFORMAT)) {
            /* clear the ADDSEND bit */
            hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
        } else {
            if(0 == p_i2c->slave_address.address_count) {
                /* clear the ADDSEND bit */
                hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
                p_i2c->slave_address.address_count = 1;
                /* send a start condition to I2C bus */
                HAL_I2C_START_ON_BUS(p_i2c->periph);
            } else {
                /* clear the ADDSEND bit */
                hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
            }
        }
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_RBNE)) {
        if(data_length > p_i2c->rxbuffer.pos) {
            if(3 == data_length - p_i2c->rxbuffer.pos) {
                /* wait until the second last data byte is received into the shift register */
                while(!hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_BTC));
                /* send a NACK for the last data byte */
                hals_i2c_ack_config(p_i2c->periph, I2C_ACK_DISABLE);
            }
            /* read a data byte from I2C_DATA*/
            *p_i2c->rxbuffer.buffer++ = hals_i2c_data_receive(p_i2c->periph);
            p_i2c->rxbuffer.pos++;
            if(0 == data_length - p_i2c->rxbuffer.pos) {
                if((I2C_NO_OPTION_TRANSFER != p_i2c->transfer_option) && \
                        (I2C_LAST_TRANSFER != p_i2c->transfer_option)) {
                    p_i2c->previous_state = HAL_I2C_PREVIOUS_STATE_TX;
                } else {
                    /* send a stop condition */
                    HAL_I2C_STOP_ON_BUS(p_i2c->periph);
                }

                hals_i2c_ack_config(p_i2c->periph, I2C_ACK_ENABLE);
                hals_i2c_ackpos_config(p_i2c->periph, I2C_ACKPOS_CURRENT);
                /* disable the I2C interrupt */
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);

                if(NULL != p_func) {
                    p_func(p_i2c);
                }
                p_i2c->rx_state =   HAL_I2C_STATE_READY;
            }
        }
    }
}

/*!
    \brief      DMA full finish handler in I2C master receive mode
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     none
*/
static void _i2c_receive_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2c_dev_struct *p_i2c;
    hal_i2c_user_cb p_func;

    p_dma = (hal_dma_dev_struct *)dma;
    p_i2c = (hal_i2c_dev_struct *)p_dma->p_periph;
    p_func = (hal_i2c_user_cb)p_i2c->rx_callback;
    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        p_i2c->rxbuffer.pos = p_i2c->rxbuffer.length;
        hals_i2c_dma_config(p_i2c->periph, I2C_DMA_OFF);
        p_i2c->rx_state = HAL_I2C_STATE_READY;
    }
    if(RESET != hals_i2c_flag_get(p_i2c->periph, I2C_FLAG_MASTER)) {
        HAL_I2C_STOP_ON_BUS(p_i2c->periph);
        while(I2C_CTL0(p_i2c->periph) & 0x0200);
    } else {
        while(!hals_i2c_flag_get(p_i2c->periph, I2C_FLAG_STPDET));
        /* clear the STPDET bit */
        HAL_I2C_ENABLE(p_i2c->periph);
    }
    if(NULL != p_func) {
        p_func(p_i2c);
    }
}

/*!
    \brief      event handler in I2C slave transmit mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_slave_transmit_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->tx_callback;

    uint32_t data_length;

    data_length = p_i2c->txbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)) {
        /* clear the ADDSEND bit */
        hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
    } else if((hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_TBE)) && \
              (!hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_AERR))) {
        /* send a data byte */
        hals_i2c_data_transmit(p_i2c->periph, *p_i2c->txbuffer.buffer++);
        p_i2c->txbuffer.pos++;
        if(p_i2c->txbuffer.pos == data_length) {
            if(NULL != p_func) {
                p_func(p_i2c);
            }

            /* disable I2C interrupt */
            hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
            hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
            hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);

            if(HAL_I2C_STATE_BUSY_LISTEN == p_i2c->tx_state) {
                p_i2c->tx_state = HAL_I2C_STATE_LISTEN;
            }
        }
    }
}

/*!
    \brief      event handler in I2C slave receive mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_slave_receive_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->rx_callback;
    uint32_t data_length;

