PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    data_length = p_i2c->rxbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)) {
        /* clear the ADDSEND bit */
        hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_RBNE)) {
        /* if reception data register is not empty ,I2C will read a data from I2C_DATA */
        *p_i2c->rxbuffer.buffer++ = hals_i2c_data_receive(p_i2c->periph);
        p_i2c->rxbuffer.pos++;
        if((p_i2c->rxbuffer.pos == data_length) && (HAL_I2C_STATE_BUSY_LISTEN == p_i2c->rx_state)) {
            p_i2c->rx_state = HAL_I2C_STATE_LISTEN;
            hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
            if(NULL != p_func) {
                p_func(p_i2c);
            }
        }
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_STPDET)) {
        /* clear the STPDET bit */
        HAL_I2C_ENABLE(p_i2c->periph);
        /* disable I2C interrupt */
        hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
        hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
        hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
        if(NULL != p_func) {
            p_func(p_i2c);
        }
    }
}

/*!
    \brief      event handler in I2C slave serial receive mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_slave_serial_receive_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->rx_callback;
    uint32_t data_length;

    data_length = p_i2c->rxbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)) {
        /* clear the ADDSEND bit */
        hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_RBNE)) {
        /* if reception data register is not empty ,I2C will read a data from I2C_DATA */
        *p_i2c->rxbuffer.buffer++ = hals_i2c_data_receive(p_i2c->periph);
        p_i2c->rxbuffer.pos++;

        if((p_i2c->rxbuffer.pos == data_length) && (HAL_I2C_STATE_BUSY_LISTEN == p_i2c->rx_state)) {
            p_i2c->rx_state = HAL_I2C_STATE_LISTEN;
            if(NULL != p_func) {
                p_func(p_i2c);
            }

            /* disable I2C interrupt */
            hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
            hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
            hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
            if(NULL != p_func) {
                p_func(p_i2c);
            }
        }
    }
}

/*!
    \brief      master sends device address for memory write request
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
static int32_t _i2c_memory_write(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms)
{
    /* send a start condition to I2C bus */
    HAL_I2C_START_ON_BUS(i2c_dev->periph);
    /* wait until SBSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_SBSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get SBSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* send slave address to I2C bus */
    hals_i2c_master_addressing(i2c_dev->periph, i2c_dev->slave_address.device_address, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    /* wait until the transmission data register is empty*/
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_TBE, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get TBE timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* send memory address to write to */
    if(I2C_MEMORY_ADDRESS_8BIT == i2c_dev->slave_address.address_size) {
        /* one byte address */
        hals_i2c_data_transmit(i2c_dev->periph, I2C_MEMORY_ADDRESS_LSB(i2c_dev->slave_address.memory_address));
    } else {
        /* two bytes address */
        hals_i2c_data_transmit(i2c_dev->periph, I2C_MEMORY_ADDRESS_MSB(i2c_dev->slave_address.memory_address));
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_TBE, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get TBE timeout");
            return HAL_ERR_TIMEOUT;
        }
        hals_i2c_data_transmit(i2c_dev->periph, I2C_MEMORY_ADDRESS_LSB(i2c_dev->slave_address.memory_address));
    }
    /* wait for BTC set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_BTC, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get BTC timeout");
        return HAL_ERR_TIMEOUT;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      master sends device address for memory read request
    \param[in]  i2c_dev: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
static int32_t _i2c_memory_read(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms)
{
    /* enable acknowledge */
    hals_i2c_ack_config(i2c_dev->periph, I2C_ACK_ENABLE);
    /* send a start condition to I2C bus */
    HAL_I2C_START_ON_BUS(i2c_dev->periph);
    /* wait until SBSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_SBSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get SBSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* send slave address to I2C bus */
    hals_i2c_master_addressing(i2c_dev->periph, i2c_dev->slave_address.device_address, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    hals_i2c_flag_clear(i2c_dev->periph, I2C_FLAG_ADDSEND);
    /* wait until the TBE bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_TBE, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get TBE timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* send memory address to I2C bus */
    if(I2C_MEMORY_ADDRESS_8BIT == i2c_dev->slave_address.address_size) {
        hals_i2c_data_transmit(i2c_dev->periph, I2C_MEMORY_ADDRESS_LSB(i2c_dev->slave_address.memory_address));
    } else {
        hals_i2c_data_transmit(i2c_dev->periph, I2C_MEMORY_ADDRESS_MSB(i2c_dev->slave_address.memory_address));
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_TBE, SET, timeout_ms)) {
            HAL_DEBUGW("i2c get TBE timeout");
            return HAL_ERR_TIMEOUT;
        }
        hals_i2c_data_transmit(i2c_dev->periph, I2C_MEMORY_ADDRESS_LSB(i2c_dev->slave_address.memory_address));
    }
    /* wait until the BTC bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_BTC, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get BTC timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* send a start condition to I2C bus */
    HAL_I2C_START_ON_BUS(i2c_dev->periph);
    /* wait until SBSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_SBSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get SBSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* send slave address to I2C bus */
    hals_i2c_master_addressing(i2c_dev->periph, i2c_dev->slave_address.device_address, I2C_RECEIVER);
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c_dev->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)) {
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      event handler of memory write in I2C master mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_memmory_write_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->tx_callback;
    uint32_t data_length;

