PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2c.c
    data_length = p_i2c->txbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_SBSEND)) {
        /* send slave address */
        hals_i2c_master_addressing(p_i2c->periph, p_i2c->slave_address.device_address, I2C_TRANSMITTER);
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)) {
        /*clear ADDSEND bit */
        hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_TBE)) {
        if(RESET == p_i2c->slave_address.address_complete) {
            if(I2C_MEMORY_ADDRESS_8BIT == p_i2c->slave_address.address_size) {
                hals_i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_LSB(p_i2c->slave_address.memory_address));
                p_i2c->slave_address.address_complete = SET;
            } else {
                if(0 == p_i2c->slave_address.address_count) {
                    hals_i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_MSB(p_i2c->slave_address.memory_address));
                    p_i2c->slave_address.address_count++;
                } else {
                    hals_i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_LSB(p_i2c->slave_address.memory_address));
                }
            }
            p_i2c->slave_address.address_complete = SET;
        } else {
            if(data_length > p_i2c->txbuffer.pos) {
                /* the master sends a data byte */
                hals_i2c_data_transmit(p_i2c->periph, *p_i2c->txbuffer.buffer++);
                p_i2c->txbuffer.pos++;

            } else {
                /* the master sends a stop condition to I2C bus */
                HAL_I2C_STOP_ON_BUS(p_i2c->periph);
                /* disable the I2C interrupt */
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
                if(NULL != p_func) {
                    p_func(p_i2c);
                }
                p_i2c->tx_state = HAL_I2C_STATE_READY;
            }
        }
    }
}

/*!
    \brief      event handler of memory read in I2C master mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_memory_read_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->rx_callback;
    uint32_t data_length;

    data_length = p_i2c->rxbuffer.length;

    if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_SBSEND)) {
        if(RESET == p_i2c->slave_address.second_addressing) {
            hals_i2c_master_addressing(p_i2c->periph, p_i2c->slave_address.device_address, I2C_TRANSMITTER);

        } else {
            /* the master sends slave address */
            hals_i2c_master_addressing(p_i2c->periph, p_i2c->slave_address.device_address, I2C_RECEIVER);
        }
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)) {
        if(RESET == p_i2c->slave_address.second_addressing) {
            /* clear the ADDSEND bit */
            hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
        } else {
            if((1 == data_length - p_i2c->rxbuffer.pos) || \
                    (2 == data_length - p_i2c->rxbuffer.pos)) {
                /* clear the ACKEN before the ADDSEND is cleared */
                hals_i2c_ack_config(p_i2c->periph, I2C_ACK_DISABLE);
                /* clear the ADDSEND bit */
                hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
            } else {
                /* clear the ADDSEND bit */
                hals_i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
            }
        }
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_RBNE)) {
        if(data_length > p_i2c->rxbuffer.pos) {
            if(3 == data_length - p_i2c->rxbuffer.pos) {
                /* wait until the second last data byte is received into the shift register */
                while(!hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_BTC));
                /* send a NACK for the last data byte */
                hals_i2c_ack_config(p_i2c->periph, I2C_ACK_DISABLE);
            }
            /* read a data byte from I2C_DATA*/
            *p_i2c->rxbuffer.buffer++ = hals_i2c_data_receive(p_i2c->periph);
            p_i2c->rxbuffer.pos++;
            if(0 == data_length - p_i2c->rxbuffer.pos) {
                /* send a stop condition */
                HAL_I2C_STOP_ON_BUS(p_i2c->periph);
                hals_i2c_ack_config(p_i2c->periph, I2C_ACK_ENABLE);
                hals_i2c_ackpos_config(p_i2c->periph, I2C_ACKPOS_CURRENT);
                /* disable the I2C interrupt */
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
                hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
                if(NULL != p_func) {
                    p_func(p_i2c);
                }
            }
        }
    } else if(hals_i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_TBE)) {
        if(I2C_MEMORY_ADDRESS_8BIT == p_i2c->slave_address.address_size) {
            hals_i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_LSB(p_i2c->slave_address.memory_address));
            p_i2c->slave_address.second_addressing = SET;
        } else {
            if(0 == p_i2c->slave_address.address_count) {
                hals_i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_MSB(p_i2c->slave_address.memory_address));
                p_i2c->slave_address.address_count++;
            } else {
                hals_i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_LSB(p_i2c->slave_address.memory_address));
            }
        }
        /* wait until BTC bit is set */
        while(!hals_i2c_flag_get(p_i2c->periph, I2C_FLAG_BTC));
        /* send a start condition to I2C bus */
        HAL_I2C_START_ON_BUS(p_i2c->periph);
    }
}

/*!
    \brief      event handler for address listen in slave mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_address_listen_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->rx_callback;

    hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
    hals_i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);

    /* check transfer direction in p_func, so that the user knows
    which function to call next(hal_i2c_slave_serial_transmit_interrupt
    or hal_i2c_slave_serial_receive_interrupt) */
    if(NULL != p_func) {
        p_func(p_i2c);
    }

}
